# PostDocEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PostDocEventArgs Class
Members See Also
---
The class is used as base class for arguments of any post-event that is associated to a particular Document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PostDocEventArgs : PostEventArgs
```

Visual Basic
---
```text
Public Class PostDocEventArgs _
	Inherits PostEventArgs
```

Visual C++
---
```text
public ref class PostDocEventArgs : public PostEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitEventArgs Autodesk.Revit.DB.Events..::..PostEventArgs Autodesk.Revit.DB.Events..::..PostDocEventArgs
# See Also
PostDocEventArgs Members
Autodesk.Revit.DB.Events Namespace